[command]/home/runner/work/_temp/7b831f65-fd8a-488a-8352-89036babb772/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.test-eip will be created
  + resource "aws_eip" "test-eip" {
      + allocation_id             = (known after apply)
      + arn                       = (known after apply)
      + associate_with_private_ip = "10.0.1.50"
      + association_id            = (known after apply)
      + carrier_ip                = (known after apply)
      + customer_owned_ip         = (known after apply)
      + domain                    = (known after apply)
      + id                        = (known after apply)
      + instance                  = (known after apply)
      + network_border_group      = (known after apply)
      + network_interface         = (known after apply)
      + private_dns               = (known after apply)
      + private_ip                = (known after apply)
      + ptr_record                = (known after apply)
      + public_dns                = (known after apply)
      + public_ip                 = (known after apply)
      + public_ipv4_pool          = (known after apply)
      + tags_all                  = (known after apply)
      + vpc                       = (known after apply)
    }

  # aws_instance.test-instance will be created
  + resource "aws_instance" "test-instance" {
      + ami                                  = "ami-0c6359fd9eb30edcf"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "ap-northeast-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-test"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "test-instance"
        }
      + tags_all                             = {
          + "Name" = "test-instance"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "d6593837446587cf58a608224d1c78e0dc5236b7"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_card_index    = 0
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_internet_gateway.test-igw will be created
  + resource "aws_internet_gateway" "test-igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "test-igw"
        }
      + tags_all = {
          + "Name" = "test-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_network_interface.test-nw-interface will be created
  + resource "aws_network_interface" "test-nw-interface" {
      + arn                       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = [
          + "10.0.1.50",
        ]
      + private_ips_count         = (known after apply)
      + security_groups           = (known after apply)
      + source_dest_check         = true
      + subnet_id                 = (known after apply)
      + tags_all                  = (known after apply)

      + attachment (known after apply)
    }

  # aws_route.test-route-ipv4 will be created
  + resource "aws_route" "test-route-ipv4" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.test-route-ipv6 will be created
  + resource "aws_route" "test-route-ipv6" {
      + destination_ipv6_cidr_block = "::/0"
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # aws_route_table.test-route-table will be created
  + resource "aws_route_table" "test-route-table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "test-route-table"
        }
      + tags_all         = {
          + "Name" = "test-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.test-association will be created
  + resource "aws_route_table_association" "test-association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.test-security-group will be created
  + resource "aws_security_group" "test-security-group" {
      + arn                    = (known after apply)
      + description            = "Allow web inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "http"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "https"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ssh"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "test-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "test-security-group"
        }
      + tags_all               = {
          + "Name" = "test-security-group"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.test-subnet will be created
  + resource "aws_subnet" "test-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "test-subnet"
        }
      + tags_all                                       = {
          + "Name" = "test-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.test-vpc will be created
  + resource "aws_vpc" "test-vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "test-vpc"
        }
      + tags_all                             = {
          + "Name" = "test-vpc"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_eip.test-eip will be created%0A  + resource "aws_eip" "test-eip" {%0A      + allocation_id             = (known after apply)%0A      + arn                       = (known after apply)%0A      + associate_with_private_ip = "10.0.1.50"%0A      + association_id            = (known after apply)%0A      + carrier_ip                = (known after apply)%0A      + customer_owned_ip         = (known after apply)%0A      + domain                    = (known after apply)%0A      + id                        = (known after apply)%0A      + instance                  = (known after apply)%0A      + network_border_group      = (known after apply)%0A      + network_interface         = (known after apply)%0A      + private_dns               = (known after apply)%0A      + private_ip                = (known after apply)%0A      + ptr_record                = (known after apply)%0A      + public_dns                = (known after apply)%0A      + public_ip                 = (known after apply)%0A      + public_ipv4_pool          = (known after apply)%0A      + tags_all                  = (known after apply)%0A      + vpc                       = (known after apply)%0A    }%0A%0A  # aws_instance.test-instance will be created%0A  + resource "aws_instance" "test-instance" {%0A      + ami                                  = "ami-0c6359fd9eb30edcf"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = (known after apply)%0A      + availability_zone                    = "ap-northeast-1a"%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "terraform-test"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = (known after apply)%0A      + tags                                 = {%0A          + "Name" = "test-instance"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "test-instance"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = "d6593837446587cf58a608224d1c78e0dc5236b7"%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification (known after apply)%0A%0A      + cpu_options (known after apply)%0A%0A      + ebs_block_device (known after apply)%0A%0A      + enclave_options (known after apply)%0A%0A      + ephemeral_block_device (known after apply)%0A%0A      + instance_market_options (known after apply)%0A%0A      + maintenance_options (known after apply)%0A%0A      + metadata_options (known after apply)%0A%0A      + network_interface {%0A          + delete_on_termination = false%0A          + device_index          = 0%0A          + network_card_index    = 0%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options (known after apply)%0A%0A      + root_block_device (known after apply)%0A    }%0A%0A  # aws_internet_gateway.test-igw will be created%0A  + resource "aws_internet_gateway" "test-igw" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Name" = "test-igw"%0A        }%0A      + tags_all = {%0A          + "Name" = "test-igw"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # aws_network_interface.test-nw-interface will be created%0A  + resource "aws_network_interface" "test-nw-interface" {%0A      + arn                       = (known after apply)%0A      + id                        = (known after apply)%0A      + interface_type            = (known after apply)%0A      + ipv4_prefix_count         = (known after apply)%0A      + ipv4_prefixes             = (known after apply)%0A      + ipv6_address_count        = (known after apply)%0A      + ipv6_address_list         = (known after apply)%0A      + ipv6_address_list_enabled = false%0A      + ipv6_addresses            = (known after apply)%0A      + ipv6_prefix_count         = (known after apply)%0A      + ipv6_prefixes             = (known after apply)%0A      + mac_address               = (known after apply)%0A      + outpost_arn               = (known after apply)%0A      + owner_id                  = (known after apply)%0A      + private_dns_name          = (known after apply)%0A      + private_ip                = (known after apply)%0A      + private_ip_list           = (known after apply)%0A      + private_ip_list_enabled   = false%0A      + private_ips               = [%0A          + "10.0.1.50",%0A        ]%0A      + private_ips_count         = (known after apply)%0A      + security_groups           = (known after apply)%0A      + source_dest_check         = true%0A      + subnet_id                 = (known after apply)%0A      + tags_all                  = (known after apply)%0A%0A      + attachment (known after apply)%0A    }%0A%0A  # aws_route.test-route-ipv4 will be created%0A  + resource "aws_route" "test-route-ipv4" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + gateway_id             = (known after apply)%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A    }%0A%0A  # aws_route.test-route-ipv6 will be created%0A  + resource "aws_route" "test-route-ipv6" {%0A      + destination_ipv6_cidr_block = "::/0"%0A      + gateway_id                  = (known after apply)%0A      + id                          = (known after apply)%0A      + instance_id                 = (known after apply)%0A      + instance_owner_id           = (known after apply)%0A      + network_interface_id        = (known after apply)%0A      + origin                      = (known after apply)%0A      + route_table_id              = (known after apply)%0A      + state                       = (known after apply)%0A    }%0A%0A  # aws_route_table.test-route-table will be created%0A  + resource "aws_route_table" "test-route-table" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name" = "test-route-table"%0A        }%0A      + tags_all         = {%0A          + "Name" = "test-route-table"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table_association.test-association will be created%0A  + resource "aws_route_table_association" "test-association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_security_group.test-security-group will be created%0A  + resource "aws_security_group" "test-security-group" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow web inbound traffic"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "http"%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "https"%0A              + from_port        = 443%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 443%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "ssh"%0A              + from_port        = 22%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 22%0A            },%0A        ]%0A      + name                   = "test-security-group"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "test-security-group"%0A        }%0A      + tags_all               = {%0A          + "Name" = "test-security-group"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # aws_subnet.test-subnet will be created%0A  + resource "aws_subnet" "test-subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "test-subnet"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "test-subnet"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_vpc.test-vpc will be created%0A  + resource "aws_vpc" "test-vpc" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = (known after apply)%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Name" = "test-vpc"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "test-vpc"%0A        }%0A    }%0A%0APlan: 11 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
